[
    {
    "id": 1,
    "title": "PhotoMaster Pro",
    "companyName": "PixelForge Ltd.",
    "image": "https://i.ibb.co.com/twxqLX85/logo-search-grid-2x.png",
    "description": "PhotoMaster Pro is your ultimate companion for creative photo editing. It comes equipped with next-generation AI-based filters that automatically enhance colors, contrast, and lighting to give every picture a professional touch. The app provides a seamless retouching toolkit that removes blemishes, smooths skin, and adjusts tones instantly. With one tap, you can transform ordinary photos into masterpieces. Professionals love its advanced layer support and brush precision tools. You can create stunning collages, apply gradient effects, and even manipulate focus depth. For influencers, it offers smart background replacement powered by AI segmentation. You’ll find built-in LUTs and HDR adjustments for cinematic looks. The app syncs with cloud storage to keep your work safe. Batch edit options save time for photographers. The interface is clean and beginner-friendly, making editing intuitive. From color correction to artistic filters, it’s built for both amateurs and pros. PhotoMaster Pro supports RAW files for DSLR shots. It also includes a one-click export for social media. With constant updates, new filters keep your creativity fresh. Discover your artistic potential every day. Let PhotoMaster Pro turn your imagination into visual art. Create, enhance, and share effortlessly with PixelForge technology. Photography redefined — one edit at a time.",
    "size": 84,
    "reviews": 12045,
    "ratingAvg": 4.6,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 7045 }
    ]
  },
  {
    "id": 2,
    "title": "FitTrack",
    "companyName": "Healthify Apps",
    "image": "https://i.ibb.co/PGwkQNhJ/FitTrack.png",
    "description": "FitTrack helps you take control of your fitness journey with smart analytics. Whether you’re tracking your workouts, steps, or calories, it provides detailed insights into your daily progress. The app integrates seamlessly with wearables and smartwatches. You can customize workout routines for strength, cardio, or yoga. Its calorie counter adjusts dynamically based on your goals. FitTrack’s dashboard visualizes your performance trends through easy charts. It also tracks hydration, sleep, and heart rate patterns. The AI trainer suggests exercises suited to your current fitness level. You can challenge friends and stay motivated with leaderboard goals. Its notification reminders keep your habits consistent. FitTrack supports both home and gym workouts. It offers detailed video guides for beginners. You can log meals using barcode scanning for faster entry. The app’s nutrition tab recommends healthy food swaps. Integration with Apple Health and Google Fit keeps everything synced. FitTrack adapts as your body evolves. The progress timeline helps you celebrate milestones. You’ll love the weekly summary reports and progress streak badges. FitTrack ensures fitness feels rewarding, not frustrating. Stay accountable, stay active, and enjoy your transformation. Healthify your lifestyle today with FitTrack — your personal coach in your pocket.",
    "size": 62,
    "reviews": 8420,
    "ratingAvg": 4.3,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 4020 }
    ]
  },
  {
    "id": 3,
    "title": "Learnify",
    "companyName": "EduNova",
    "image": "https://i.ibb.co.com/4ZtDQbk2/Learnify.png",
    "description": "Learnify transforms how students learn through an interactive digital classroom experience. It offers thousands of structured video lessons across multiple subjects. Each topic is explained by expert educators using visual aids and animations. Students can take interactive quizzes to test their knowledge instantly. The personalized dashboard shows learning progress and weak areas. Learnify uses AI to recommend lessons tailored to your skill level. Offline downloads make studying possible anywhere. It also includes discussion forums for peer learning and doubt-solving. You can earn badges and certificates as you complete lessons. The app supports all academic levels, from school to professional courses. Parents can track their child’s performance through progress reports. Teachers can create assignments and share notes directly. Learnify also supports live class sessions with real-time Q&A. It syncs across devices so you never lose your place. Students can bookmark lessons for later revision. Learnify’s interface is clean, modern, and distraction-free. It encourages active learning through gamified challenges. With EduNova’s AI insights, every learner gets a unique learning path. Learnify isn’t just an app — it’s a digital mentor. Master any subject at your own pace, anywhere, anytime. Empower your education journey with Learnify today.",
    "size": 95,
    "reviews": 15600,
    "ratingAvg": 4.8,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 10600 }
    ]
  },
  {
    "id": 4,
    "title": "TravelGo",
    "companyName": "SkyBound Tech",
    "image": "https://i.ibb.co.com/SXWYZZJm/TravelGo.png",
    "description": "TravelGo is the all-in-one travel assistant that simplifies your trip planning. Discover breathtaking destinations around the world through curated guides. You can search for flights, compare prices, and book within seconds. The app’s hotel booking feature offers exclusive deals and discounts. You can filter by budget, reviews, or amenities. TravelGo also suggests attractions and local experiences near your stay. It features an offline map mode for easy navigation abroad. Trip Planner lets you organize itineraries with dates, notes, and activities. It also tracks travel expenses for smarter budgeting. TravelGo provides real-time weather updates for your destinations. With AI recommendations, it personalizes suggestions based on your preferences. You can even create custom wishlists of dream locations. Travelers love its photo journal feature to document memories. The built-in translator helps you communicate effortlessly. Flight alerts notify you of schedule changes or price drops. TravelGo’s modern design makes exploring joyful. Share your travel stories with a global community. Whether it’s a solo adventure or family vacation, it keeps you organized. SkyBound Tech ensures security and convenience in every booking. Start exploring new horizons confidently. TravelGo — your passport to smarter, stress-free travel experiences.",
    "size": 73,
    "reviews": 9800,
    "ratingAvg": 4.2,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 3300 }
    ]
  },
  {
    "id": 5,
    "title": "NoteCraft",
    "companyName": "SoftScribe",
    "image": "https://i.ibb.co.com/Lds5nsB2/Note-Craft.webp",
    "description": "NoteCraft helps you capture ideas instantly and organize them efficiently. You can create beautifully structured notes, to-do lists, and reminders in one place. Each note can include text, images, links, and voice recordings. The interface is minimal yet powerful for focused productivity. Notes sync automatically across all your devices via cloud storage. You can tag and categorize content for quick access. The app supports markdown formatting for easy text styling. With NoteCraft, managing projects becomes simple and elegant. You can collaborate with teammates through shared notebooks. Its smart search locates any note in seconds. NoteCraft also features customizable themes and layouts. You’ll never forget a deadline with integrated task scheduling. The app includes offline mode for writing without distractions. Security is top priority — all notes are end-to-end encrypted. Backup options ensure your data is safe at all times. You can even export notes as PDF or text documents. Its widgets make quick jotting down ideas effortless. NoteCraft encourages creative journaling with daily prompts. Whether for study, work, or creativity — it adapts to you. SoftScribe’s smooth design and performance make it stand out. Elevate your note-taking experience with NoteCraft, where simplicity meets power.",
    "size": 55,
    "reviews": 6400,
    "ratingAvg": 4.5,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3600 }
    ]
  },
  {
    "id": 6,
    "title": "SoundWave",
    "companyName": "AudioZen Studios",
    "image": "https://i.ibb.co.com/MkCHtVZc/Sound-Wave.png",
    "description": "SoundWave redefines how you experience music. With millions of songs, albums, and podcasts, it’s your all-in-one audio streaming companion. The app’s intelligent AI recommends playlists based on your mood and listening history. You can create, share, and follow personalized mixes. SoundWave delivers lossless HD sound quality for true audiophiles. Its minimal interface focuses purely on sound discovery. Offline mode lets you enjoy music anywhere without data usage. The equalizer gives you full control over bass, treble, and effects. Artists can upload tracks and engage directly with fans. SoundWave supports social sharing for playlists and now-playing moments. You’ll get real-time lyrics for karaoke-style singing. Explore trending genres and regional music effortlessly. Podcasts come with smart bookmarking for resuming later. Its Night Mode and Timer features make late listening relaxing. AudioZen’s recommendation engine evolves with your taste. You can follow artists for instant release alerts. Integration with smart speakers offers seamless playback. Daily mood playlists keep your vibe alive. Whether working, relaxing, or partying — SoundWave fits every moment. Discover, vibe, and feel the rhythm like never before. Let your world move to the beat of SoundWave.",
    "size": 102,
    "reviews": 25400,
    "ratingAvg": 4.7,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 16000 }
    ]
  },
  {
    "id": 7,
    "title": "ShopSmart",
    "companyName": "EcomVerse",
    "image": "https://i.ibb.co.com/9m4tFhpH/Shop-Smart.png",
    "description": "ShopSmart is your intelligent shopping assistant for smarter online buying. It compares prices from multiple platforms to find you the best deals instantly. The app tracks discounts, coupons, and limited-time offers. You can set alerts for price drops on your favorite products. ShopSmart also curates trending items based on your preferences. Its AI engine analyzes market trends and recommends cost-effective alternatives. You can save products to wishlists for later purchase. With barcode scanning, check real-time prices in physical stores. ShopSmart includes verified reviews and rating analysis for authenticity. It supports multiple currencies for international buyers. You can explore electronics, fashion, groceries, and more in one interface. Personalized notifications ensure you never miss a sale. The cashback tracker rewards you for every purchase. Dark mode ensures comfortable night browsing. EcomVerse’s secure payment gateway guarantees safe transactions. The app’s clean layout and advanced filters make shopping effortless. ShopSmart also highlights eco-friendly and sustainable products. Get your spending insights with visual analytics. Shopping isn’t just easier — it’s smarter. Maximize savings and minimize effort. Let ShopSmart revolutionize how you shop online.",
    "size": 89,
    "reviews": 18700,
    "ratingAvg": 4.4,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 7800 }
    ]
  },
  {
    "id": 8,
    "title": "MindEase",
    "companyName": "Calmify Labs",
    "image": "https://i.ibb.co.com/KxFtqM6Y/MindEase.png",
    "description": "MindEase is designed to bring peace, focus, and emotional balance to your life. It offers guided meditations for stress, sleep, and mindfulness. The app’s calm sound library includes nature sounds and ambient music. Personalized meditation sessions adjust to your mood. MindEase’s breathing exercises help reduce anxiety quickly. The daily check-in feature tracks emotional well-being. Sleep stories narrated by soothing voices help you unwind. MindEase offers focus sessions for productivity enhancement. Its Mind Journal lets you reflect on thoughts and growth. You can set reminders for meditation and gratitude moments. The design is minimalist and free from clutter. Calming color themes enhance relaxation. You can track your streaks to maintain daily consistency. MindEase also includes mini relaxation games to lift your spirit. Offline access ensures peace even without the internet. The AI coach provides personalized suggestions over time. MindEase community shares positivity and wellness tips. Scientific breathing patterns improve oxygen flow and calmness. Built for beginners and experts alike, it’s truly universal. Discover mental clarity and inner harmony effortlessly. Calmify Labs crafted MindEase to nurture your best self. Pause, breathe, and let peace find you.",
    "size": 68,
    "reviews": 9100,
    "ratingAvg": 4.9,
    "downloads": "4.5M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1300 },
      { "name": "5 star", "count": 6600 }
    ]
  }
]
